
#weather
questions_class1 = ["วันนี้อากาศเป็นไง","อากาศเป็นยังไง","บ้านแกร้อนป้ะ","อากาศเป็นไง","ฝนจะตกไหม"
,"ร้อนมั้ย","วันนี้ฝนตกปะ","อากาศดีมั้ย","ฝนตกป้ะ","ร้อนมั๊ย","อากาศเป็นยังไง","ฝนตกปะ"
,"วันนี้ฝนตกป่าว","วันนี้แถวนั้นอากาศดีปะ","ฝนตกป่ะ","ฟ้าเป็นไงบ้าง","อากาศร้อนมั้ย","ฝนตกป้ะมึง"
,"ตอนนี้อากาศดีมั้ย","แดดแรงไหมมึง","อากาศวันนี้เป็นไงบ้าง","ร้อนมั้ย","ข้างนอกร้อนป่ะ","อากาศดีป่ะ","ฝนตกมั้ย"
,"ร้อนป่าว","บ้านมึงร้อนปะ","อากาศเป็นไงบ้างวะ","ร้อนทั้งวันมึงว่าไหม","วันนี้อากาศป็นไงมั้ง?","ข้างนอกฝนตกไหม",
"แดดร้อนไหม","ที่นู่นหนาวมั้ย","ฝนตกหรือป่าว","วันนี้ฟ้าเปิดไหม","อากาศเป็นไงบ้าง","อากาศดีปะ","วันนี้ฝนตกป่าววะ","ฟ้าครึ้มมั๊ย","ฝนตกปะ",
"แดดแรงปะ","วันนี้แดดแรงมั๊ย","หนาวปะ","อากาศหนาวปะ","ดูอุณหภูิหน่อย","อุณหภูมิเท่าไหร่","อุณภูมิเท่าไร","ทำไมร้อนจัง","วันนี้ต้องเอาร่มไปมั๊ย",
"ต้องพกร่มมั๊ย" ,"ใส่เสื้อกันหนาวดีมั๊ย","เอาเสื้อกันหนาวไปดีปะ" ]
#google map
questions_class2 = ["ไปไง","ไปยังไง","ไปไงอ่ะ","จะนั่งรถไรไปดีวะ","กูอยากไป"
,"ไปทางไหนไวๆถูกๆบ้าง","ลาดกระบังอยู่ตรงไหนของกทมวะ?","จะไปได้อย่างไร","จะไปทางไหนได้บ้าง","ไปไงดี","จากไปยังไง"
,"จากไปยังไงหรอ","ไปกันมั๊ย","จากไปไปยังไงได้มั่ง","ขึ้นรถไปอนุตรงไหน","ไปไงอะ","มึงถ้ากูจะไปกูไปทางไหนได้บ้างวะ","จากมอเราไปยังไง"
,"มีรถอะไรไปได้บ้าง","นั่งรถอะไรไปได้บ้าง","จากไปยังไงได้บ้าง","อยากไป","ไปไม่เป็น","ไปยังไงง่ายสุด","รถอะไรไปบ้าง","กูจะไปนี่ ไปไงวะ"
,"อยากไปวะไปไงวะ","จากไปยังไง","มีรถแท็กซี่ไปไหม","จากไป ไปยังไงได้มั้ง","จากไปไปไง ถ้าไปรถตู้","พาไปหน่อย","แผนที่","ดูแผนที่หน่อย"
,"จะไปยังไงจากที่นี้","ไปยังไง","ไปไปยังไง"]
#translate
questions_class3 =["แปลว่าอะไร","แปลว่าอะไร","แปลว่าอะไร","แปลให้หน่อย","แปลให้หน่อย","คือไรอ่ะ"
,"มันแปลว่าไรวะ","เปิดdictแล้วงง","ไม่เข้าใจ","หมายถึงอะไร","แปลว่าอะไร","แปลว่า","ไม่รู้จริงๆ","แปลว่าอะไร"
,"แปลว่าอะไรหาให้หน่อย","แปลว่าไร","แปลว่าอะไรแปลให้หน่อย","แปลให้หน่อยดิ","เปิดดิกคำว่าให้ที","แปลให้"
,"คือไร","คำนี้แปลว่าไรวะ","มันแปลว่าไร","คือไรวะ","แม่งแปลว่าไรวะ","คือไร","คำนี้แปลว่าอะไรอะ","รู้ความหมายของคำนึ้ปะ"
,"หมายความว่าไง","รู้ความหมายคำนี้ป่ะ","คำนี้แปลว่าไร","แปลว่าไร","แปลว่ารัย"]

#train schedule
questions_class4 = ["ขอตารางรถไฟหน่อย","ขอตารางรถไฟหน่อยดิ"
,"มีตารางรถไฟป่าว","มีตารางรถไฟไหม","มีตารางรถไฟไหม","ขอดูตารางรถไฟหน่อยดิ่"
,"กูอยากได้ตารางเวลาของรถไฟ","รถไฟออกกี่โมงบ้าง","ใครมีตารางรถไฟให้ยืมมั้ง","ตารางรถไฟให้หน่อย","มีตารางรถไฟปะ","ขอตารางรถไฟฟน่อย"
,"มึงมีตารางรถไฟไทยปะ","อยากได้ตารางเวลารถไฟ","ขอตารางรถไฟหน่อยดิ","มีรถไฟรอบไหนบ้าง","ดูตารางรถไฟให้หน่อย"
,"มีตารางรถไฟปะ","รถไฟมีรอบกี่โมงบ้าง","มีตารางรถไฟป่ะ","ดูตารางรถไฟจากที่ไหนได้บ้าง","ตารางรถไฟหาได้จากไหนอะ"
,"ยืมตารางรถไฟหน่อย","มีรอบรถไฟเที่ยวปะ","ตารางรถไฟขอที่ไหนอะ","ใครมีตารางรถไฟมั่ง","ขอตารางถไฟหน่อย",
"ขอตารางรถไฟหน่อยดิ้","ขอดูตารางรถไฟหน่อย",
"รถไฟรอบหน้ามากี่โมง","รถไฟมากี่โมง","จะทันรถไฟรอบหน้าป้ะ","กูอยากรู้ว่ารถไฟมันจะมาอีกทีกี่โมง"
,"รอบหน้าตอนไหน","อีกกี่นาทีกว่ารถไฟจะมา","รถไฟรอบต่อไปมากี่โมงวะ","รถไฟรอบต่อไปจะมากี่โมง","อีกกี่นาทีรถไฟจะมา","รถไฟรอบหน้ามากี่โมง"
,"รถไฟรอบต่อไปมาเมื่อไหร่","รถไฟรอบต่อไปมากี่โมง","ต่อไปรถไฟจะมากี่โมง","รถไฟมาเร็วสุดกี่โมง","อีกกี่นาทีรถไฟจะมาวะ"
,"รถไฟจะมาอีกทีกี่โมงอ่ะ","รถไฟรอบหลังจากมากี่โมง","อีกนานไหมกว่ารถไฟจะมา","อีกนานมั้ยกว่ารถจะมา","รถไฟต่อไปรอบไร"
,"รถไฟจะมาอีกทีตอนไหนวะ","รถไฟมากี่โมง","ตารางรถไฟมีรอบไหนบ้าง","เอาตารางรถไฟจากไหน","ตารางรฟไฟหาได้จากไหนอะ"
,"รถไฟรอบนี้ออกไปยัง","รอไฟมากี่โมง","รถไฟขบวนต่อไปกี่โมง","รถไฟรอบต่อไปกี่โมง","รถไฟมาอีกทีกี่โมง"]

#train table
questions_class4_1 = ["ขอตารางรถไฟหน่อย","ขอตารางรถไฟหน่อยดิ"
,"มีตารางรถไฟป่าว","มีตารางรถไฟไหม","มีตารางรถไฟไหม","ขอดูตารางรถไฟหน่อยดิ่"
,"กูอยากได้ตารางเวลาของรถไฟ","รถไฟออกกี่โมงบ้าง","ใครมีตารางรถไฟให้ยืมมั้ง","ตารางรถไฟให้หน่อย","มีตารางรถไฟปะ","ขอตารางรถไฟฟน่อย"
,"มึงมีตารางรถไฟไทยปะ","อยากได้ตารางเวลารถไฟ","ขอตารางรถไฟหน่อยดิ","มีรถไฟรอบไหนบ้าง","ดูตารางรถไฟให้หน่อย"
,"มีตารางรถไฟปะ","รถไฟมีรอบกี่โมงบ้าง","มีตารางรถไฟป่ะ","ดูตารางรถไฟจากที่ไหนได้บ้าง","ตารางรถไฟหาได้จากไหนอะ"
,"ยืมตารางรถไฟหน่อย","มีรอบรถไฟเที่ยวปะ","ตารางรถไฟขอที่ไหนอะ","ใครมีตารางรถไฟมั่ง","ขอตารางถไฟหน่อย",
"ขอตารางรถไฟหน่อยดิ้","ขอดูตารางรถไฟหน่อย","ตารางรถไฟมีรอบไหนบ้าง"]

#next train
questions_class4_2 = ["รถไฟรอบหน้ามากี่โมง","รถไฟมากี่โมง","จะทันรถไฟรอบหน้าป้ะ","กูอยากรู้ว่ารถไฟมันจะมาอีกทีกี่โมง"
,"รอบหน้าตอนไหน","อีกกี่นาทีกว่ารถไฟจะมา","รถไฟรอบต่อไปมากี่โมงวะ","รถไฟรอบต่อไปจะมากี่โมง","อีกกี่นาทีรถไฟจะมา","รถไฟรอบหน้ามากี่โมง"
,"รถไฟรอบต่อไปมาเมื่อไหร่","รถไฟรอบต่อไปมากี่โมง","ต่อไปรถไฟจะมากี่โมง","รถไฟมาเร็วสุดกี่โมง","อีกกี่นาทีรถไฟจะมาวะ"
,"รถไฟจะมาอีกทีกี่โมงอ่ะ","รถไฟรอบหลังจากมากี่โมง","อีกนานไหมกว่ารถไฟจะมา","อีกนานมั้ยกว่ารถจะมา","รถไฟต่อไปรอบไร"
,"รถไฟจะมาอีกทีตอนไหนวะ","รถไฟมากี่โมง","เอาตารางรถไฟจากไหน","ตารางรฟไฟหาได้จากไหนอะ"
,"รถไฟรอบนี้ออกไปยัง","รอไฟมากี่โมง","รถไฟขบวนต่อไปกี่โมง","รถไฟรอบต่อไปกี่โมง","รถไฟมาอีกทีกี่โมง"]

#class schedule
questions_class5 = ["เรียนกี่โมงวะ" , "วันนี้เรียนกี่โมงวะ","เรียนกี่โมงฟะ" , "วันนี้เรียนกี่โมงฟะ","เรียนกี่โมงอะ" , "วันนี้เรียนกี่โมงอะ","เรียนกี่โมง" ,
                    "วันนี้เรียนกี่โมง", "พรุ่งนี้เรียนกี่โมง" ,"มีเรียนอะไรบ้าง","เรียนอะไรบ้าง","เรียนวันไหน",
                   "เรียนกี่โมง","เรียนวิชานี้กี่โมง","วันนี้ต้องเข้าเรียนกี่โมง" , "มีเรียนมั๊ย","พรุ่งนี้เีรียนกี่โมง",
                   "พนเรียนกี่โมง","พุ่งนี้เรียนกี่โมง","ดูเวลาเรียนหน่อย","เรียนกี่โมง","พนเข้าเรียนกี่โมง","ต้องเข้าเรียนกี่โมง","เรียนเช้าหรือบ่าย",
                    "มีเรียนเช้าไหม","มีเรียนไหม","เริ่มเรียนยัง","ต้องไปเรียนมั๊ย","ต้องไปเรียนกี่โมง","เรียนห้องไหนวะ","วันนี้เรียนห้องไหนวะ","เรียนห้องไหนวะ",
                    "เรียนห้องไหนอะ","เรียนห้องไหน","วันนี้เรียนห้องไหน","พรุ่งนี้เรียนห้องไหน","พนเรียนห้องไหน","ต้องไปเรียนห้องไหน","วันนี้เรียนห้องไหน","ห้องไหน","วันนี้เรียนห้องไหน",
                   "วันนี้เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน"
                   ,"เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน"
                   ,"เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน","เรียนห้องไหน",
                   "เรียนวิชาอะไร","เรียนอะไร","เรีนนวิชาอะไร","พรุ่งน้เรียนวิชาอะไร","พนเรียนวิชาอะไร","วันนี้เรียนวิชาอะไร","เรียนอะไร",
                   "เรียนวิชาอะไร" ,"วันนี้เรียนวิชาอะไร"]
#exam schedule
questions_class6 = ["สอบกี่โมงวะ" , "วันนี้สอบกี่โมงวะ","สอบกี่โมงวะ" , "วันนี้สอบกี่โมงวะ","สอบกี่โมงอะ" , "วันนี้สอบกี่โมงอะ","สอบกี่โมง" ,
                    "วันนี้สอบกี่โมง","ขอตารางสอบ","ขอตารางสอบหน่อย", "พรุ่งนี้สอบกี่โมง" ,"มีสอบอะไรบ้าง","สอบอะไรบ้าง","สอบวันไหน",
                   "เริ่มสอบวันไหน","สอบเสร็จวันไหน","สอบเสดวันไหน","พนสอบกี่โมง","วันนี้สอบอะไรบ้าง","พนสอบอะไรบ้าง","ดูตารางสอบหน่อย",
                   "วันนี้ต้องสอบกี่โมง","สอบห้องไหนวะ","วันนี้สอบห้องไหนวะ","สอบห้องไหนวะ","สอบห้องไหนอะ","สอบห้องไหน","วันนี้สอบห้องไหน",
                     "พรุ่งนี้สอบห้องไหน","พนสอบห้องไหน","ต้องไปสอบห้องไหน","วันนี้สอบห้องไหน","สอบห้องไหน","วันนี้สอบห้องไหน",
                   "วันนี้สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน"
                   ,"สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน"
                   ,"สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน","สอบห้องไหน",
                    "สอบวิชาอะไร","สอบอะไร","เรีนนวิชาอะไร","พรุ่งน้สอบวิชาอะไร","พนสอบวิชาอะไร","วันนี้สอบวิชาอะไร","สอบอะไร",
                   "สอบวิชาอะไร" ,"วันนี้สอบวิชาอะไร"]
#transcipt
questions_class7 = ["ขอดูเกรดหน่อย","ขอดูเกรดหน่อยดิ","ขอดดูทรานสคิป","ขอดูทรายสคิปหน่อยดิ","เกรดออกยัง","ได้เกรดไรวะ","ดูเกรดหน่อย",
                   "เทอมนี้ได้เกรดเท่าไหร่","เกรดเท่าไหร่"]
#time table
questions_class8 = ["ดูตารางเวลา" , "ดูตารางนัดหมาย","วันนี้มีนัดมั๊ย","มีนัดกี่โมง","พรุ่งนี้มีนัดมั๊ย","พรุ่งนี้มีนัดกี่โมง","ดูตารางเวลาหน่อย",
                     "พรุ่งนี้มีนัดไหม","มีนัดวันไหนบ้าง","ขอดูเวลาว่างหน่อย","เช็คตารางเวลาว่างให้หน่อย","วันที่ว่างมั๊ย","ว่างกี่โมง","ว่างมั๊ย",
                     "บ่ายโมง","เที่ยง","พรุ่งนี้ต้องทำอะไรบ้าง","นัดกี่โมงวะ","นัดกี่โมงอะ","มีนัดอะไรบ้าง","มีนัดวันไหน","เชคให้หน่อยว่าวางไหม",
                   "มีนัดไหม",
                   "เซฟตารางเวลาให้หน่อย" , "เพิ่มตารางเวลาให้หน่อย" , "วันที่มีนัดตอนบ่ายสามนะ" , "เพิ่มตารางเวลาตอน" ,
                     "อาทิดหน้าวันเสามีนัดตอนบ่ายสาม","วันที่มีนัดนะ" ,"เซฟวันนัดวันที่ให้หน่อย" ,"เพิ่มตารางนัดวันที่","เพิ่มนัดวันที่ให้หน่อย",
                   
                   "เซฟตารางเวลาให้หน่อย" , "ลบตารางเวลาให้หน่อย" , "ยกเลิกนัดตอนให่้หน่อย" , "ลบตารางเวลาตอน" ,
                     "ยกเลิกนัดตอนบ่ายสาม","ลบวันนัดวันที่ให้หน่อย","ยกเลิกนัดวันที่ให้หน่อย" ,"ลบตารางนัดวันที่","ลบนัดวันที่ให้หน่อย"]
#event table
questions_class8_1 = ["ดูตารางเวลา" , "ดูตารางนัดหมาย","วันนี้มีนัดมั๊ย","มีนัดกี่โมง","พรุ่งนี้มีนัดมั๊ย","พรุ่งนี้มีนัดกี่โมง","ดูตารางเวลาหน่อย",
                     "พรุ่งนี้มีนัดไหม","มีนัดวันไหนบ้าง","ขอดูเวลาว่างหน่อย","เช็คตารางเวลาว่างให้หน่อย","วันที่ว่างมั๊ย","ว่างกี่โมง","ว่างมั๊ย",
                     "บ่ายโมง","เที่ยง","พรุ่งนี้ต้องทำอะไรบ้าง","นัดกี่โมงวะ","นัดกี่โมงอะ","มีนัดอะไรบ้าง","มีนัดวันไหน","เชคให้หน่อยว่าวางไหม",
                   "มีนัดไหม"]
#add event
questions_class8_2 = ["เซฟตารางเวลาให้หน่อย" , "เพิ่มตารางเวลาให้หน่อย" , "วันที่มีนัดตอนบ่ายสามนะ" , "เพิ่มตารางเวลาตอน" ,
                     "อาทิดหน้าวันเสามีนัดตอนบ่ายสาม","วันที่มีนัดนะ" ,"เซฟวันนัดวันที่ให้หน่อย" ,"เพิ่มตารางนัดวันที่","เพิ่มนัดวันที่ให้หน่อย",
                     "เซฟตารางเวลาให้หน่อย" , "เพิ่มตารางเวลาให้หน่อย" , "วันที่มีนัดตอนบ่ายสามนะ" , "เพิ่มตารางเวลาตอน" ,
                     "อาทิดหน้าวันเสามีนัดตอนบ่ายสาม","วันที่มีนัดนะ" ,"เซฟวันนัดวันที่ให้หน่อย" ,"เพิ่มตารางนัดวันที่","เพิ่มนัดวันที่ให้หน่อย"]
#delete event
questions_class8_3 = ["ลบตารางเวลาให้หน่อย" , "ลบตารางเวลาให้หน่อย" , "ยกเลิกนัดตอนให่้หน่อย" , "ลบตารางเวลาตอน" ,
                     "ยกเลิกนัดตอนบ่ายสาม","ลบวันนัดวันที่ให้หน่อย","ยกเลิกนัดวันที่ให้หน่อย" ,"ลบตารางนัดวันที่","ลบนัดวันที่ให้หน่อย",
                     "เซฟตารางเวลาให้หน่อย" , "เพิ่มตารางเวลาให้หน่อย" , "วันที่มีนัดตอนบ่ายสามนะ" , "เพิ่มตารางเวลาตอน" ,
                     "อาทิดหน้าวันเสามีนัดตอนบ่ายสาม","วันที่มีนัดนะ" ,"เซฟวันนัดวันที่ให้หน่อย" ,"เพิ่มตารางนัดวันที่","เพิ่มนัดวันที่ให้หน่อย"]

#teacher class
questions_class9 = ["วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร",
                   "วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร",
                   "วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร","วิชานี้ใครสอน" ,"ใครสอน","เรียนกับใคร"]
#class table 
questions_class10 = ["ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้","ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้"
                    ,"ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้","ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้"
                    ,"ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้","ขอตารางเรียน","ขอตารางเรียนหน่อย", "เทอมนี้เรียนอะไรบ้าง" , "เรียนอะไรบ้างเทอมนี้"
                     ,"ขอตาางเรียนหน่อย","ดูตารางเรียนหน่อย"]
#Exam table
questions_class11 = ["ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้","ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้"
                    ,"ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้","ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้"
                    ,"ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้","ขอตารางสอบ","ขอตารางสอบหน่อย", "เทอมนี้สอบอะไรบ้าง" , "สอบอะไรบ้างเทอมนี้"]

#vacation start
questions_class12 = ["ปิดทอมเมื่อไหร่","ปิดเทอมวันไหน","เมื่อไหร่จะเปิดเทอม","เมื่อไหร่จะปิดเทอม","ปิดเทอมวันไหนอะ","อยากปิดเทอม",
                     "ปิดเทอมยังอะ","ปิดเทอมวันไหน","ปิดทอมเมื่อไหร่","ปิดเทอมวันไหน","เมื่อไหร่จะเปิดเทอม","เมื่อไหร่จะปิดเทอม","ปิดเทอมวันไหนอะ","อยากปิดเทอม",
                     "ปิดเทอมยังอะ","ปิดเทอมวันไหน"]

#semester start
questions_class13 = ["เปิดทอมเมื่อไหร่","เปิดเทอมวันไหน","เมื่อไหร่จะเเปิดเทอม","เมื่อไหร่จะเปิดเทอม","เปิดเทอมวันไหนอะ","อยากเปิดเทอม",
                     "เปิดเทอมยังอะ","เปิดเทอมวันไหน","เปิดทอมเมื่อไหร่","เปิดเทอมวันไหน","เมื่อไหร่จะเเปิดเทอม","เมื่อไหร่จะเปิดเทอม","เปิดเทอมวันไหนอะ","อยากเปิดเทอม",
                     "เปิดเทอมยังอะ","เปิดเทอมวันไหน"] 
#registration date
questions_class14 = ["ลงทะเบียนวันไหน","ลงทะเบียนเรียนเมื่อไหร่","วันลงทะเบียนเมื่อไหร่","เมื่อไร่จะถึงวันลงทะเบียน" ,"เมื่อไหร่ลงทะเบียน"]




#ปอปต้องโหลดใน cmd บางตัว
import PyICU
import pandas as pd #pip install pandas
import numpy as np  #pip install numpy
from sklearn.feature_extraction.text import TfidfVectorizer   #pip install sklearn
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from sklearn.feature_extraction.text import CountVectorizer
import re  
import sys, json        
import jwt

def isThai(chr):
    cVal = ord(chr)
    if(cVal >= 3584 and cVal <= 3711):
        return True
    return False
#tokenize function
def tokenize(txt):
    bd = PyICU.BreakIterator.createWordInstance(PyICU.Locale("th"))
    bd.setText(txt)
    lastPos = bd.first()
    retTxt = ""
    try:
        while(1):
            currentPos = next(bd)
            retTxt += txt[lastPos:currentPos]
            if(isThai(txt[currentPos-1])):
                if(currentPos<len(txt)):
                    if(isThai(txt[currentPos])):
                        retTxt+="|"
            lastPos = currentPos
    except StopIteration:
        pass
    return retTxt
#full tokenize function
def my_split(s):
    return tokenize(s).split("|")


def  df_generate(questions_class , Class):
    words = [word for word in questions_class]
    df = pd.DataFrame({
        "Class" : Class,
        "Questions" : words
        })
    return df

def get_subject(string) :
    splits = my_split(string)
    words = ["digital broadcast" , "information mathematic" , "security"]
    for word in words:
        for split in splits:
            if word in split:
                return word
    return "You don't have this "


def get_day(string):
    days = ["จันทร์","อังคาร","พุธ","พฤหัส","ศุกร์","เสาร์","อาทิตย์"]
    tmr_keys =  ['พน','พรุ่ง นี้','พุ่ง นี้']
    ytd_keys = ['เมื่อ วาน']
    after_tmr_keys = ["มะรืน"]
    vec = CountVectorizer(min_df = 1 , tokenizer = my_split , ngram_range = (1,2))
    vec.fit_transform([string])
    for i in vec.get_feature_names():
        if i in tmr_keys:
            return "tomorrow"
        elif i in ytd_keys:
            return "yesterday"
        elif i in after_tmr_keys:
            return "after tommorow"
        elif i in days:
            return i
    return "Today"
        
def get_time(string):
    for i in my_split(string):
        if i == "บ่าย" or i =="เที่ยง":
            return "afternoon"
        elif i == "เช้า":
            return "morning"
        elif i == "evening":
            return "evening"

    return "none"
        
def filterThai(str):
    thai = ""
    eng  = ""
    for i in str:
        if(isThai(i)):
            thai = thai+i
        else:
            eng = eng +i
    return [thai,eng]

#get date from text
def get_date(text):
    date_key_lv1 = ["สามสิบ เอ็ด","ยี่สิบ เอ็ด","ยี่สิบ สอง","ยี่สิบ สาม","ยี่สิบ สี่","ยี่สิบ ห้า","ยี่สิบ หก","ยี่สิบ เจ็ด","ยี่สิบ แปด","ยี่สิบ เก้า",
                 "สิบ เอ็ด","สิบ สอง","สิบ สาม","สิบ สี่","สิบ ห้า","สิบ หก","สิบ เจ็ด","สิบ แปด","สิบ เก้า"]
    date_key_lv2 = ["หนึ่ง","สามสิบ","สิบ","ยี่สิบ","สอง","สาม","สี่","ห้า","หก","เจ็ด","แปด","เก้า"]
    vec = CountVectorizer(min_df = 1 , ngram_range = (1,2) , tokenizer  = my_split)
    vec.fit_transform([text])
    for i in vec.get_feature_names():
        if i in date_key_lv1:
            return i.replace(" ","")
    for i in vec.get_feature_names():
        if i in date_key_lv2:
            return i


def trim(text):
    return text.replace("\"" , "")
    

    
def predicted(new_question , dataframe):
    #create a list of all question and all class
    questions = df.Questions.tolist()
    Class = df.Class.tolist()

    #feature extraction
    vectorizer = TfidfVectorizer(min_df  = 1 , tokenizer = my_split , ngram_range = (1,1) )
    tfidf_questions = vectorizer.fit_transform(questions).toarray()
    
    #fit a naivebayes classifier
    clf = MultinomialNB().fit(tfidf_questions , Class)
    
    #prediction
    #transform new questionn
    transformed_new_question = vectorizer.transform([new_question])
    #predict
    predicted = clf.predict(transformed_new_question)
    return predicted[0]




#main
#all dataframe
df1 = df_generate(questions_class1 , "weather")
df2 = df_generate(questions_class2 , "google map")
df3 = df_generate(questions_class3 , "translate")
df4 = df_generate(questions_class4 , "train table")
df5 = df_generate(questions_class5 , "class schedule")
df6 = df_generate(questions_class6 , "exam schedule")
df7 = df_generate(questions_class7, "transcript")
df8 = df_generate(questions_class8 , "life schedule")
df9 = df_generate(questions_class9 , "teacher")
df10 = df_generate(questions_class10 , "class table")
df11 = df_generate(questions_class11 , "exam table")
df12 = df_generate(questions_class12 , "vacation start date")
df13 = df_generate(questions_class13 , "semester start date")
df14 = df_generate(questions_class14 , "register date")
df = pd.concat([df1,df2,df3,df4,df5,df6,df7,df8,df9,df10,df11,df12,df13,df14])
    
#sub data frame for life schedule
df8_1 = df_generate(questions_class8_1 ,"table")
df8_2 = df_generate(questions_class8_2 , "add event")
df8_3 = df_generate(questions_class8_3 , "delete event")
df8_full = pd.concat([df8_1,df8_2,df8_3])


#sub data frame for train schedule
df4_1 = df_generate(questions_class4_1 , "train table")
df4_2 = df_generate(questions_class4_2 ,  "next train")
df4_full = pd.concat([df4_1,  df4_2])

lines = sys.stdin.readlines()
#new_question = trim(jwt.decode(lines[0],'secret' , algorithms = ['HS256'])['some'])
#new_question_thai = filterThai(new_question)[0] 
print(lines)
# new_question_thai = lines[0]
# predicted = predicted(new_question_thai , df)

# #weather , day
# if(predicted=="weather"):
#     print("weather"+get_day(new_question))
# #google map , fixing
# elif(predicted=="google map"):
#     print("google map")
# # class name and english word
# elif(predicted =="translate"):
#     print("translate"+","+filterThai(new_question)[1])
# #train ,  whether is next train or train table
# elif(predicted == "train_table"):
#     train_predicted = predicted(new_question_thai , df4_full)
#     print(train_predicted)
# #class time , day , time(morning , afternoon , evenning) ,fixing 
# elif(predicted == "class schedule"):
#     print(predicted+","+get_day(new_question)+","+get_time(new_question))

# #exam time , day , time , fixxing 
# elif(predicted == "exam schedule"):
#     print(predicted+","+get_day(new_question)+","+get_time(new_question))

# #life  , table , add , delete
# elif(predicted == "life schedule"):
#     life_predicted  = predicted(new_question_thai , df8_full)
#     print(life_predicted)

# #teacher , subject name
# elif(predicted == "teacher"):
#     print(predicted+","+filterThai(new_question)[1])

# #class table or exam table or transcipt or vacation start or semester start or register
# else:
#     print(predicted)


