module.exports = [{
		faculty: 'Please select a Faculty',
		major: [{ main: 'Please select a Department', sub: ['Please select a Major'] }],
	}, {
		faculty: 'วิศวกรรมศาสตร์',
		major: [{ main: 'ทุกภาควิชา', sub: ['ทุกภาควิชา'] }, { main: 'วิศวกรรมโทรคมนาคม', sub: ['วิศวกรรมโทรคมนาคม'] }, { main: 'วิศวกรรมไฟฟ้า', sub: ['วิศวกรรมไฟฟ้า', 'วิศวกรรมพลังงานไฟฟ้า'] }, { main: 'อิเล็กทรอนิกส์', sub: ['อิเล็กทรอนิกส์', 'วิศวกกรรมชีวการเเพทย์'] }, { main: 'วิศวกรรมระบบควบคุม', sub: ['วิศวกรรมระบบควบคุม', 'วิศวกรรมเเมคคาทรอนิกส์'] },
			{ main: 'วิศวกรรมคอมพิวเตอร์', sub: ['วิศวกรรมคอมพิวเตอร์', 'วิศวกรรมสารสนเทศ', 'Computer Innovation Engineering'] }, { main: 'วิศวกรรมเครื่องกล', sub: ['วิศวกรรมเครื่องกล', 'วิศวกรรมขนส่งทางราง'] }, { main: 'วิศวกรรมการวัดคุม', sub: ['วิศวกรรมการวัดคุม', 'วิศวกรรมอัตโนมัติ'] }, { main: 'วิศวกรรมโยธา', sub: ['วิศวกรรมโยธา'] }, { main: 'วิศวกรรมเกษตร', sub: ['วิศวกรรมเกษตร'] },
			{ main: 'วิศวกรรมเคมี', sub: ['วิศวกรรมเคมี', 'วิศวกรรมปิโตรเคมี'] }, { main: 'วิศวกรรมอาหาร', sub: ['วิศวกรรมอาหาร'] }, { main: 'วิศวกรรมอุตสาหการ', sub: ['วิศวกรรมอุตสาหการ'] }
		],
	}, {
		faculty: 'สถาปัตยกรรมศาสตร์',
		major: [{ main: 'สถาปัตยกรรมศาสตร์', sub: ['สถาปัตยกรรมศาสตร์'] }],
	}, {
		faculty: 'ครุศาสตร์อุตสาหกรรมและเทคโนโลยี',
		major: [{ main: 'ครุศาสตร์อุตสาหกรรมและเทคโนโลยี', sub: ['ครุศาสตร์อุตสาหกรรมและเทคโนโลยี'] }],
	},

	{
		faculty: 'เทคโนโลยีการเกษตร',
		major: [{ main: 'เทคโนโลยีการเกษตร', sub: ['เทคโนโลยีการเกษตร'] }],
	}, {
		faculty: 'วิทยาศาสตร์',
		major: [{ main: 'วิทยาศาสตร์', sub: ['วิทยาศาสตร์'] }],
	}, {
		faculty: 'อุตสาหกรรมเกษตร',
		major: [{ main: 'อุตสาหกรรมเกษตร', sub: ['อุตสาหกรรมเกษตร'] }],
	},

	{
		faculty: 'เทคโนโลยีสารสนเทศ',
		major: [{ main: 'เทคโนโลยีสารสนเทศ', sub: ['เทคโนโลยีสารสนเทศ'] }],
	}, {
		faculty: 'วิทยาลัยนานาชาติ',
		major: [{ main: 'วิทยาลัยนานาชาติ', sub: ['วิทยาลัยนานาชาติ'] }],
	}, {
		faculty: 'วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง',
		major: [{ main: 'วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง', sub: ['วิทยาลัยนาโนเทคโนโลยีพระจอมเกล้าลาดกระบัง'] }],
	}, {
		faculty: 'วิทยาลัยนวัตกรรมการผลิตขั้นสูง',
		major: [{ main: 'วิทยาลัยนวัตกรรมการผลิตขั้นสูง', sub: ['วิทยาลัยนวัตกรรมการผลิตขั้นสูง'] }],
	}, {
		faculty: 'การบริหารและจัดการ',
		major: [{ main: 'การบริหารและจัดการ', sub: ['การบริหารและจัดการ'] }],
	},

	{
		faculty: 'วิทยาลัยอุตสาหกรรมการบินนานาชาติ',
		major: [{ main: 'วิทยาลัยอุตสาหกรรมการบินนานาชาติ', sub: ['วิทยาลัยอุตสาหกรรมการบินนานาชาติ'] }],
	}, {
		faculty: 'ศิลปศาสตร์',
		major: [{ main: 'ศิลปศาสตร์', sub: ['ศิลปศาสตร์'] }],
	}
]
